Strömungssimulation/Beleg/simulationen/wärmeübertrager_3/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.015;

boundaryField
{
    // DONE: Setzen Sie die Turbulenzintensität auf 10%
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
	intensity	0.01;
        value           uniform 0.015;
    }

    outlet
    {
        type            zeroGradient;
    }

    "pipe.*"
    {
        type            kLowReWallFunction; //kqRWallFunction;
        value           uniform 0.015;
    }

    frontAndBack
    {
        type            empty;
    }

    cyclic_top
    {
        type            cyclic;
    }
    cyclic_bottom
    {
        type            cyclic;
    }
}


// ************************************************************************* //
