Strömungssimulation/Beleg/simulationen/wärmeübertrager_3/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    "pipe.*"
    {
        type            nutLowReWallFunction; //nutkWallFunction;
        value           uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }

    cyclic_top
    {
        type            cyclic;
    }
    cyclic_bottom
    {
        type            cyclic;
    }
}


// ************************************************************************* //
