Strömungssimulation/Beleg/simulationen/wärmeübertrager_3/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    pipe-0
    {
        type            calculated;
        value           nonuniform List<vector> 
76
(
(-0.712481 -0.0973106 0)
(-0.713384 -0.0974281 8.47319e-20)
(-0.791941 -0.104718 0)
(-0.790958 -0.104589 0)
(-0.790958 0.104589 0)
(-0.713384 0.0974281 -8.47319e-20)
(-0.680542 -0.0732231 2.97781e-20)
(-0.854423 -0.0573495 5.38767e-20)
...
)
;
    }
    pipe-1
    {
        type            calculated;
        value           nonuniform List<vector> 
78
(
(-0.871604 0.0200699 -2.15045e-20)
(-0.853592 0.0572693 0)
(-0.872474 -0.0200721 -0)
(-0.854242 -0.0572962 -0)
(-0.854045 0.0572747 0)
(-0.713533 -0.0974522 -8.64457e-20)
(-0.681802 0.0733747 0)
(-0.712234 -0.0972762 2.85034e-20)
...
)
;
    }
    pipe-2
    {
        type            calculated;
        value           nonuniform List<vector> 
78
(
(-0.68109 -0.0732871 -3.22156e-20)
(-0.712418 -0.0973012 -4.73167e-20)
(-0.713093 0.0973885 -9.35224e-20)
(-0.712631 0.0973333 -2.72923e-20)
(-0.790257 0.104498 6.62364e-20)
(-0.853233 -0.0572171 0)
(-0.790489 -0.104525 0)
(-0.791369 0.104644 -8.33501e-20)
...
)
;
    }
    pipe-5
    {
        type            calculated;
        value           nonuniform List<vector> 
78
(
(-0.854881 0.0573305 0)
(-0.853347 0.057224 4.10784e-20)
(-0.790482 0.104525 0)
(-0.791308 -0.104636 8.33443e-20)
(-0.712517 0.0973221 4.73268e-20)
(-0.713017 -0.0973812 -0)
(-0.790279 -0.104492 -6.62328e-20)
(-0.712538 -0.0973134 2.72774e-20)
...
)
;
    }
    pipe-3
    {
        type            calculated;
        value           nonuniform List<vector> 
76
(
(-0.791054 0.104593 0)
(-0.791922 0.104719 0)
(-0.713582 0.0974587 0)
(-0.712539 -0.0973027 -3.87049e-20)
(-0.681777 0.0733626 0)
(-0.713582 -0.0974587 0)
(-0.791922 -0.104719 0)
(-0.791054 -0.104593 0)
...
)
;
    }
    pipe-4
    {
        type            calculated;
        value           nonuniform List<vector> 
78
(
(-0.712291 -0.0972826 0)
(-0.681718 -0.0733544 0)
(-0.680606 0.0732317 -1.65264e-20)
(-0.791646 -0.104682 1.48932e-19)
(-0.713606 0.0974627 8.64341e-20)
(-0.853905 -0.0572627 -6.51849e-20)
(-0.86758 -0.0199698 0)
(-0.853576 -0.0572405 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    cyclic_top
    {
        type            cyclic;
    }
    cyclic_bottom
    {
        type            cyclic;
    }
}


// ************************************************************************* //
