Strömungssimulation/Beleg/simulationen/wärmeübertrager_3/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    pipe-0
    {
        type            calculated;
        value           nonuniform List<scalar> 
76
(
3.71469
3.7123
3.71175
3.71404
3.71404
3.7123
3.71482
3.71229
...
)
;
    }
    pipe-1
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
3.70653
3.71413
3.70469
3.71274
3.71318
3.71193
3.71143
3.71533
...
)
;
    }
    pipe-2
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
3.71334
3.71485
3.71305
3.71431
3.71568
3.71495
3.71516
3.71308
...
)
;
    }
    pipe-5
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
3.71136
3.7147
3.71517
3.71322
3.71464
3.71327
3.71568
3.7145
...
)
;
    }
    pipe-3
    {
        type            calculated;
        value           nonuniform List<scalar> 
76
(
3.71387
3.71177
3.71181
3.71442
3.71148
3.71181
3.71177
3.71387
...
)
;
    }
    pipe-4
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
3.71517
3.71163
3.71465
3.71242
3.71175
3.71349
3.71512
3.7142
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    cyclic_top
    {
        type            cyclic;
    }
    cyclic_bottom
    {
        type            cyclic;
    }
}


// ************************************************************************* //
