Strömungssimulation/Beleg/simulationen/wärmeübertrager_3/system/cellMax
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out the maximum cell value for one or more fields.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/functions/volFieldValue/cellMax.cfg"

name U_max;
fields  ( U );

// ************************************************************************* //
