Strömungssimulation/Beleg/simulationen/wärmeübertrager_3/system/volAverage
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out the volume-weighted average of one or more fields.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/functions/volFieldValue/volAverage.cfg"

name U_mean;
fields  ( U );

// ************************************************************************* //
